test/cwmp_builder_SUITE_data/cwmp_Download.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:cwmp="urn:dslforum-org:cwmp-1-0"><soapenv:Header/><soapenv:Body><cwmp:Download><CommandKeyType/><DownloadFileType>1</DownloadFileType><URL>http://announceURL-FwUpgr/</URL><Username/><Password/><FileSize>1024</FileSize><TargetFileName/><DelaySeconds>300</DelaySeconds><SuccessURL>http://successURL-FwUpgr/</SuccessURL><FailureURL>http://failureURL-FwUpgr/</FailureURL></cwmp:Download></soapenv:Body></soapenv:Envelope>